{
    "AAD": {
        "description": "Analogique-Analogique-Digital",
        "link": "https://fr.m.wikipedia.org/wiki/AAD",
        "def": "\nCette page d’homonymie répertorie les différents sujets et articles partageant un même nom.\n\n\n\n  Sigles de 2 caractères\n► Sigles de 3 caractères\n  Sigles de 4 caractères\n  Sigles de 5 caractères\n  Sigles de 6 caractères\n  Sigles de 7 caractères\n  Sigles de 8 caractères\n\n\nSur les autres projets Wikimedia :\naad, sur le Wiktionnaire\n\nAAD est un code, qui peut désigner :\n\nAd-Dabbah au Soudan, selon la liste des codes AITA des aéroports ;\nl'indicatif d'appel de la compagnie aérienne Aero Aviation Centre Ltd., au Canada, selon la liste des codes OACI des compagnies aériennes ;\nanalog-analog-digital, selon la liste des codes SPARS, soit un disque compact au format CDDA enregistré en analogique, masterisé en analogique et diffusé en numérique.AAD est un sigle, qui peut signifier :\n\naccouchement assisté à domicile ;\nappel à discussion, un code sur le réseau Usenet ;\nAutomatic Activation Device (en), un déclencheur de sécurité pour parachutistes ;\nanti-viraux à action directe, une classe de médicaments, incluant notamment les derniers traitements contre l'hépatite C (VHC)."
    },
    "AAL": {
        "description": "ATM Adaptation Layer",
        "link": "https://fr.m.wikipedia.org/wiki/Asynchronous_Transfer_Mode#Couches_AAL_.28ATM_Adaptation_Layer.29",
        "def": "\nPour les articles homonymes, voir ATM.\n\n\n\nCet article ne cite pas suffisamment ses sources (juin 2017).\nSi vous disposez d'ouvrages ou d'articles de référence ou si vous connaissez des sites web de qualité traitant du thème abordé ici, merci de compléter l'article en donnant les références utiles à sa vérifiabilité et en les liant à la section « Notes et références » \nEn pratique : Quelles sources sont attendues ? Comment ajouter mes sources ?\n\n\nLe mode de transfert asynchrone (en anglais Asynchronous Transfer Mode ou ATM) est un protocole de la couche « liaison de donnée» au sens du « modèle OSI » à commutation de cellules, qui a pour objectif de multiplexer différents flots de données sur un même lien physique en utilisant une technique de TDM ou MRT (multiplexage à répartition dans le temps).\nATM a été conçu pour fournir un standard réseau unifié qui pourrait supporter un trafic réseau synchrone (SDH), aussi bien qu'un trafic utilisant des paquets (IP, relais de trames…) tout en supportant plusieurs niveaux de qualité de service (QdS).\nATM est un protocole asynchrone, s'appuyant fréquemment sur une couche de transport synchrone. C'est-à-dire que les cellules ATM sont envoyées de manière asynchrone, en fonction des données à transmettre, mais sont insérées dans le flux de données synchrones d'un protocole de niveau inférieur pour leur transport.\n\nSommaire\n1 Commutation de cellules\n2 Structure d'une cellule\n3 Couches AAL (ATM Adaptation Layer)\n4 Cadre originel\n5 Évolution et remplacement\n6 Notes et références\n7 Voir aussi\n7.1 Articles connexes\n7.2 Liens externes\n\n\n"
    },
    "ABAP": {
        "description": "Allgemeiner Berichtsaufbereitungsprozessor, (en anglaisВ : Advanced Business Application Programming) Langage dans SAP",
        "link": "https://fr.m.wikipedia.org/wiki/ABAP",
        "def": "\n\nABAPDate de première version\n\n1983\n\nInfluencé par\n\nCobol\n\nLicence\n\nLicence propriétaire\n\nSite web\n\nscn.sap.com/community/abap\n\nmodifier \nABAP est un langage de programmation propriétaire, faisant partie de l'ensemble logiciel SAP. Il s'agit actuellement du langage utilisé dans la programmation des Web Application Server faisant partie de la plateforme NetWeaver pour la réalisation de progiciels.\nSa version ABAP/4 est objet, le chiffre 4 faisant de plus référence à son appartenance à la classe des langages de quatrième génération.\n\nSommaire\n1 Histoire\n2 Composants du langage\n3 ABAP pour quoi faire ?\n4 Exemples de programmes ABAP\n5 Notes et références\n6 Voir aussi\n6.1 Article connexe\n6.2 Liens externes\n\n\n"
    },
    "ACK": {
        "description": "Acknowledge character (Acquittement (logique))",
        "link": "https://fr.m.wikipedia.org/wiki/ACK",
        "def": "\nCette page d’homonymie répertorie les différents sujets et articles partageant un même nom.\n\n\n\n  Sigles de 2 caractères\n► Sigles de 3 caractères\n  Sigles de 4 caractères\n  Sigles de 5 caractères\n  Sigles de 6 caractères\n  Sigles de 7 caractères\n  Sigles de 8 caractères\n\n\nSur les autres projets Wikimedia :\nACK, sur le Wiktionnaire\n\nACK peut faire référence à :\n\nack, un acquittement en informatique ;\nack, une commande en informatique se voulant alternative à grep ;\ndrapeau ACK, dans TCP ;\nack ou A, dans la Fonction d'Ackermann ;\nNantucket Airlines, selon la liste des codes OACI des compagnies aériennes ;\nNantucket Memorial Airport (Ackerly Field), dans le Massachusetts, aux États-Unis, selon la liste des codes AITA des aéroports.\nACK est aussi une grande Église composée de plusieurs filiales dont la majorité est en Afrique.ACK veut dire assemblée chrétienne de Kinshasa."
    },
    "AC97": {
        "description": "Audio Codec '97 (Audio Codec 1997)",
        "link": "https://fr.m.wikipedia.org/wiki/AC97",
        "def": "\nCet article est une ébauche concernant le matériel informatique.\nVous pouvez partager vos connaissances en l’améliorant (comment ?) selon les recommandations des projets correspondants.\n\n\nL’AC'97, ou AC97, pour Audio Codec ’97 est un codec audio d'Intel. Il est généralement implémenté par un processeur sonore ou un processeur de signal numérique, se trouvant dans une puce, que ce soit sur la carte mère d'un ordinateur, dans une prise USB (casques-micro USB par exemple), sur un modem, ou encore sur une carte son. Dans le cas d'un Système sur une puce (SoC), ce processeur est généralement intégré au sein de la puce intégrant l'ensemble du système.\nDepuis 2004, il est remplacé chez Intel par le High Definition Audio (en).\n\n"
    },
    "AC": {
        "description": "Alternating current",
        "link": null,
        "def": "non disponible sur Wikipédia"
    },
    "ACL": {
        "description": "Access Control List",
        "link": "https://fr.m.wikipedia.org/wiki/Access_Control_List",
        "def": "\nCet article ne s'appuie pas, ou pas assez, sur des sources secondaires ou tertiaires (décembre 2021).\nPour améliorer la vérifiabilité de l'article ainsi que son intérêt encyclopédique, il est nécessaire, quand des sources primaires sont citées, de les associer à des analyses faites par des sources secondaires.\n\n\n\nPour les articles homonymes, voir ACL et ACE.\n\n\nAccess Control List (ACL) — liste de contrôle d'accès en français — désigne traditionnellement deux choses en sécurité informatique :\n\nun système permettant de faire une gestion plus fine des droits d'accès aux fichiers que ne le permet la méthode employée par les systèmes UNIX.\nen réseau, une liste des adresses et ports autorisés ou interdits par un pare-feu.La notion d'ACL est cela dit assez généraliste, et on peut parler d'ACL pour gérer les accès à n'importe quel type de ressource.\nUne ACL est une liste d’Access Control Entry (ACE) ou entrée de contrôle d'accès donnant ou supprimant des droits d'accès à une personne ou un groupe.\n\nSommaire\n1 ACL sur les fichiers\n1.1 Sous UNIX\n1.1.1 Utilisation\n\n1.2 Windows\n\n2 En réseau\n3 Note et référence\n4 Liens externes\n\n"
    },
    "ACPI": {
        "description": "advanced configuration and power interface",
        "link": "https://fr.m.wikipedia.org/wiki/ACPI",
        "def": "\n\n\nCet article ne cite pas suffisamment ses sources (juillet 2010).\nSi vous disposez d'ouvrages ou d'articles de référence ou si vous connaissez des sites web de qualité traitant du thème abordé ici, merci de compléter l'article en donnant les références utiles à sa vérifiabilité et en les liant à la section « Notes et références » \nEn pratique : Quelles sources sont attendues ? Comment ajouter mes sources ?\n\n\nL’Advanced Configuration and Power Interface (ACPI, en français « interface avancée de configuration et de gestion de l’énergie ») est une norme de gestion de la consommation énergétique, très largement répandue dans les ordinateurs personnels et codéveloppée par Hewlett-Packard, Intel, Microsoft, Phoenix et Toshiba.\n Exemple de tableaux ACPI.\nLe but de cette norme est de réduire la consommation d’énergie d’un ordinateur en mettant hors tension certains éléments : lecteurs CD-ROM, disques durs, écran, etc. Pour cela, une interface a été spécifiée qui permet au système d’exploitation d’envoyer des signaux aux périphériques matériels (à condition que ceux-ci prennent en charge l’ACPI). Cette interface permet aussi au matériel d’envoyer des signaux au système d’exploitation, par exemple lorsque l’utilisateur appuie sur le bouton de mise en route sur le clavier ou que le modem reçoit un appel.\nCette norme est utilisée aussi bien sur les ordinateurs portables que sur les ordinateurs de bureau postérieurs à 1996. La toute dernière spécification, publiée en janvier 2016, porte le numéro de version 6.1[1].\n\nSommaire\n1 Présentation\n2 Concepts\n2.1 États du système et sommeil (Global states / Sleep states)\n2.2 États des périphériques (Device states)\n2.3 États des processeurs (CPU states)\n\n3 Tables ACPI\n4 Notes et références\n5 Annexes\n5.1 Articles connexes\n5.2 Liens externes\n\n\n"
    },
    "ACRONYM (acronyme)": {
        "description": "Abbreviated Coded Rendition Of Name Yielding Meaning",
        "link": "https://fr.m.wikipedia.org/w/index.php?title=ACRONYM&action=edit&redlink=1",
        "def": "non disponible sur Wikipédia"
    },
    "ADMX": {
        "description": "ADMinistrative XML template file (StratГ©gies de groupe)",
        "link": "https://fr.m.wikipedia.org/wiki/ADMX",
        "def": "\nPour les articles homonymes, voir Axion (homonymie).\n\n\nL’axion est une particule hypothétique, supposée stable, neutre et de très faible masse (entre quelques µeV et quelques meV). Son existence découle de la solution de Peccei-Quinn (en) (1977) au problème de violation de la symétrie CP en chromodynamique quantique[1]. Depuis, il est proposé comme l'un des constituants possibles de la matière noire.\nDe nombreuses expériences tentent aujourd'hui de trouver cette particule, parmi lesquelles on compte CAST[2], située au CERN, mais aussi ADMX[3], ainsi que des expériences de regénération de lumière à travers un mur, comme OSQAR[4] et beaucoup d'autres.\n\nSommaire\n1 Naissance de l'axion\n1.1 Problème CP fort\n1.2 Résolution du problème\n1.3 Origine du nom « axion »\n\n2 Propriétés supposées\n3 Recherches expérimentales\n3.1 Projet PVLAS\n3.2 Projet CAST\n3.3 Projet ADMX\n3.4 Autres expériences\n\n4 Implications cosmologiques\n5 Notes et références\n6 Voir aussi\n6.1 Articles connexes\n6.2 Bibliographie\n6.3 Liens externes\n\n\n"
    },
    "ADO": {
        "description": "ActiveX Data Object de Windows",
        "link": "https://fr.m.wikipedia.org/wiki/ActiveX_Data_Object",
        "def": "\nPour les articles homonymes, voir ADO.\n\n\n\nCet article est une ébauche concernant un logiciel.\nVous pouvez partager vos connaissances en l’améliorant (comment ?) selon les recommandations des projets correspondants.\n\n\n\nCet article ne cite pas suffisamment ses sources (octobre 2012).\nSi vous disposez d'ouvrages ou d'articles de référence ou si vous connaissez des sites web de qualité traitant du thème abordé ici, merci de compléter l'article en donnant les références utiles à sa vérifiabilité et en les liant à la section « Notes et références » \nEn pratique : Quelles sources sont attendues ? Comment ajouter mes sources ?\n\n\nActiveX Data Object ou ADO est une bibliothèque logicielle de Microsoft[1] fournissant une interface d'accès aux données dans l'environnement Windows.\nElle permet aux programmes clients d'accéder aux données, et de les manipuler, dans un fichier ou un serveur de base de données.\nCette bibliothèque logicielle est une évolution de DAO.\nDepuis la sortie du Framework .NET, il est utilisé de manière connecté ou déconnecté (dataset). Il est basé sur l'utilisation du format XML, et de l'état des lignes (DatarowState). La version 2 de ADO.Net, sortie en novembre 2005 avec le Framework 2, apporte des classes indépendantes du moteur d'exécution.\n\nSommaire\n1 ADO.NET\n2 Exemple en ASP\n3 Notes et références\n4 Voir aussi\n\n"
    },
    "ADPCM": {
        "description": "Adaptive Differential Pulse Code Modulation, algorithme et format de donnГ©e",
        "link": "https://fr.m.wikipedia.org/wiki/ADPCM",
        "def": "\n\n\nCet article est une ébauche concernant l’informatique.\nVous pouvez partager vos connaissances en l’améliorant (comment ?) selon les recommandations des projets correspondants.\n\n\nL’Adaptive Differential Pulse Code Modulation (ADPCM) (en français, Modulation par impulsions et codage différentiel adaptatif (MICDA)) est un algorithme non standardisé de compression de données avec perte.\nL’algorithme repose sur la présence d’un schéma de prédiction et d’un codage des erreurs entre la prédiction et le signal original. Les erreurs étant souvent de faibles magnitudes, une compression intéressante est possible grâce à la diminution des bits nécessaires à l’opération. Dans le cas de l'ADPCM, ce codage est dynamique et tient compte de la grandeur des erreurs en modifiant le pas de quantification.\nLors du décodage, les erreurs sont ajoutées au signal issu de la prédiction pour obtenir un signal plus ou moins fidèle à l’original. Ce système est surtout utilisé pour les fichiers audio, en particulier les échantillons vocaux.\nEn résumé, l'ADPCM tient compte des propriétés suivantes :\n\nle signal est quasi-stationnaire ;\nla prédiction est adaptative ;\nla prédiction utilise les données précédentes et fournit de nouvelles données ;\nla prédiction tente de minimiser l’erreur ;\nune bonne prédiction assure une réduction de l'erreur et donc du taux de transmission.Au milieu des années 1980, le CCITT a introduit l’ADPCM à 32 kbit/s (G.721). Plus tard, le G.726 et G.727 avec des taux différents (16, 24, 32  et   40 kbit/s). Par la suite, plusieurs formats et variantes firent leur apparition. Citons notamment les codecs de Microsoft et Apple nommés IMA mais avec des différences entre les deux versions.\n\n"
    },
    "ADSI": {
        "description": "Active Directory Service Interface",
        "link": "https://fr.m.wikipedia.org/wiki/ADSI",
        "def": " \nCet article est une ébauche concernant l’informatique et la sécurité informatique.\nVous pouvez partager vos connaissances en l’améliorant (comment ?) selon les recommandations des projets correspondants.\n\n\n\nCet article ne cite aucune source et peut contenir des informations erronées (signalé en mai 2023).\nSi vous disposez d'ouvrages ou d'articles de référence ou si vous connaissez des sites web de qualité traitant du thème abordé ici, merci de compléter l'article en donnant les références utiles à sa vérifiabilité et en les liant à la section « Notes et références ».\n\nTrouver des sources sur « Active Directory Service Interfaces » : Bing\nCairn\nDuckDuckGo\nE. Universalis\nGallica\nGoogle\nG. Books\nG. News\nG. Scholar\nPersée\nQwant\n(zh) Baidu\n(ru) Yandex\n(wd) trouver des œuvres sur Active Directory Service Interfaces\n\n\n\nCet article manque de repères chronologiques ou de dates (mai 2023).\nVous pouvez ajouter les données manquantes avec leurs sources.\n\n\nActive Directory Service Interfaces (abrégé en ADSI) est une bibliothèque logicielle de Microsoft qui permet aux programmeurs de lire et manipuler le contenu d'un annuaire Active Directory via une interface de programmation basée sur le modèle COM.\nCette bibliothèque logicielle de Microsoft est utilisé notamment par ADSI Edit (utilitaire de Microsoft) afin d’interroger et modifier des enregistrements d'un annuaire Active Directory. \n\nCette section est vide, insuffisamment détaillée ou incomplète. Votre aide est la bienvenue ! Comment faire ?\n"
    },
    "ADSL": {
        "description": "ligne d'abonnГ© numГ©rique Г  dГ©bit asymГ©trique (asymmetric digital subscriber line)",
        "link": "https://fr.m.wikipedia.org/wiki/ADSL",
        "def": "\nL’ADSL (de l'anglais Asymmetric Digital Subscriber Line) est une technique de communication numérique (couche physique) de la famille xDSL. Elle permet d'utiliser une ligne téléphonique, une ligne spécialisée, ou encore une ligne RNIS (en anglais ISDN pour integrated services digital network), pour transmettre et recevoir des données numériques de manière indépendante du service téléphonique conventionnel (analogique). À ce titre, cette méthode de communication diffère de celle utilisée lors de l'exploitation de modems dits « analogiques », dont les signaux sont échangés dans le cadre d'une communication téléphonique (similaire au fax, c'est-à-dire sur des fréquences vocales). La technologie ADSL est massivement mise en œuvre par les fournisseurs d'accès à Internet pour le support des accès dits « haut-débit ».\n\nSommaire\n1 Description\n2 Histoire\n3 Principe de fonctionnement\n4 Mise en œuvre\n5 Détails de fonctionnement\n5.1 Domaine fréquentiel\n5.2 Répartition des sous-porteuses entre sens montant et sens descendant\n5.3 Modulation des sous-porteuses\n5.4 Structure des informations\n5.4.1 Trames ADSL\n5.4.2 Supertrames ADSL\n\n5.5 Capacité de trafic\n5.5.1 Sens descendant\n5.5.2 Sens montant\n\n5.6 ADSL2+\n5.7 Transport des données\n5.8 Gestion des erreurs de transmission\n5.9 Redistribution des bits entre sous-porteuses (bitswap)\n5.10 Latence de transmission\n\n6 Estimation du débit maximal réel en fonction de la longueur de la ligne\n7 Problèmes de transmission\n8 Applications de l'ADSL\n9 Offres commerciales\n10 Notes et références\n11 Voir aussi\n11.1 Articles connexes\n11.2 Liens externes\n\n\n"
    }
}